# day = input('Введите день недели: ')
#
# if day == 'воскресенье':
#     print('Магазин не работает')
# else:
#     time = int(input('Введите время (24-часовой формат): '))
#     if time >= 8 and time <= 22:
#         print('Магазин открыт')
#     else:
#         print('Магазин закрыт')

# age = int(input('Введите ваш возраст:'))
# genre = input('Какой жанр вы хотите посмотреть?')
#
# if genre == 'ужасы':
#     if age < 18:
#         print('Этот жанр вам не подходит по возрасту')
#     else:
#         print('Приятного просмотра!')
# elif genre == 'драма' or genre == 'комедия':
#     if age < 13:
#         print('Вам лучше посмотреть мультики')
#     else:
#         print('Приятного просмотра')
# else:
#     print('Такого жанра не существует. Пожалуйста, выберите другой жанр')

# num = int(input('Введите число: '))
#
# if num % 2 == 0 and num % 3 == 0:
#     print('Число четное и кратное 3')
# elif num % 2 == 0:
#     print('Число четное, но не кратное 3')
# else:
#     print('Число нечетное')

# num = int(input('Введите число: '))
#
# if num > 9 and num < 100:
#     if num // 10 % 2 == 0:
#         print('Первая цифра числа четная')
#     else:
#         print('Первая цифра числа нечетная')
# else:
#     print('Ошибка! Введите двузначное число')