# number = 5
# answer = input('Ваш ответ: ')
#
# if answer == 'end':
#     answer = 5

# number = int(input('Введите число '))
# if number > 0:
#     print('Введенное пользователем число больше 0')
# if number < 0:
#     print('Введенное пользователем число меньше 0')
# if number == 0:
#     print('Введенное пользователем число равно 0')

# ed = int(input('Сколько единиц товара вам нужно купить? '))
# # st = int(input('Стоимость единицы товара '))
# # den = int(input('Введите количество ваших денег '))
# # print(f'За {ed} ед. товара вы должны заплатить {st * ed} руб.')
# #
# # if (den - (ed * st)) >= 0:
# #     print('Вы сможете приобрести данный товар')
# # if (den - (ed * st)) < 0:
# #     print('Вы не сможете приобрести данный товар')

# onepr = int(input('Введите количество баллов за первую проверочную работу '))
# twopr = int(input('Введите количество баллов за вторую проверочную работу '))
# threepr = int(input('Введите количество баллов за третью проверочную работу '))
# print()
# srball = (onepr + twopr + threepr) / 3
# print(f'Ваш средний балл равен {srball}')
# print()
# if srball >= 95:
#     print('Поздравляю! У вас высокий средний балл!')
# else:
#     print('Ваш балл менее 95, не расстраивайтесь!')

# chislo = int(input('Введите число: '))
# if chislo > 0:
#     print(f'введённое число {chislo} является положительным')
# if chislo < 0:
#     print(f'введённое число {chislo} является отрицательным')
# if chislo == 0:
#     print(f'введённое число {chislo} является нулём')

# num = int(input('Введите число: '))
# if num % 2 == 0:
#    print(f'введённое число {num} является четным')
# else:
#    print(f'введённое число {num} является нечетным')

# password = ('123456')
# parol = input('Введите пароль: ')
#
# if parol == password:
#     print('Доступ разрешен')
# else:
#     print('Доступ запрещён!')

# s = ''
#
# if s:
#     print('Строка является пустой')
# else:
#     print('Строка не является пустой')

# s = 'Hello world'
# if 'w' in s:
#     print('Эта строка содержит w')

# if int(input('Введите число ')) == 0:
#     print('Это число является нулём!')
# else:
#     print('Это число не является нулём!')

# num = 256
# if 100 <= num <= 999:
#     print('Это число является трёхзначным')
# else: print('Это число не является трёхзначным')