# print(input('Сегодня на улице: +3')) #- показатель температуры

# print(input('Введите показатель температуры ')) #- введение показателя температуры пользователем
# print('Показания введены!')

# print(85+19) #- сумма чисел

# print(8 ** 12 // 12 ** 6 ) #-возведение в степень двух чисел и их целочисленное деление

# print('Сумма двух чисел = ', 5 + 5)

# print('pyt\nhon')

# print('Pyt', end = '')
# print('hon')

# print('Конечный результат = ', (200 - 195) * (33 / 11))

# print(12345 // 10000)
# print(12345 // 1000 % 10)
# print(12345 // 100 % 10)
# print(12345 // 10 % 10)
# print(12345 % 10)

# print(input('Какая сейчас погода?'))

# print('Классная', input(), 'погода')

# print('Можно задать тебе', input())

# input()
# print('Можно задать тебе вопрос?')

# print(input('Какая сейчас погода?'))
# print('Какая сегодня классная, хорошая, великолепная погода!')

# print('Какая сегодня классная,',input('Какая сегодня погода?'), ',' ,'великолепная погода!')

# print('Вот, я вывел для тебя желаемое число:', input('Какое число вывести на экран?\n'))

# print('Я - ступенька №', input())
# print('Я - ступенька №', input())
# print('Я - ступенька №', input())

# print('Приятно познакомиться,', input('Привет! Представьтесь, пожалуйста.\n'))
# print('Я очень рад, что твои дела обстоят', input('А как у тебя дела?\n'))

# print('Моё имя', input(),'\nМне', input(), 'лет')
# print('Привет, ', input('Привет! Как тебя зовут? '))

# print('ЧЕЛОВЕК: Мое имя - ', input('РОБОТ: Здравствуй, человек! Как твоё имя?\n'),
# '\n\nРОБОТ:А моё имя - R2D3. Приятно познакомиться!', '\nЧЕЛОВЕК: Мне тоже.')

# print(87654321 % 100 // 10)
# print(87654321 % 10000 // 1000)
# print(87654321 % 1000000 // 100000)
# print(87654321 // 10000000)