# print (10 > 9)
# print (3 != 4)
# print(5 == 10 - 5)
# print(9 > 8 - 2)
# print(3 >= 2)
# print(4 >= 4)

# money = int(input('Сколько ты зарабатываешь?(тыс.руб):'))
# if money <= 20:
#     print('Подумайте о смене деятельности')
# elif 21 < money < 50:
#     print('Вы являетесь средним классом')
# else:
#     print('Вы крепко стоите на ногах')

# num = 1234
# if num // 1000 % 2 != 0:
#     print('Первая цифра числа - нечётная')
# else:
#     print('Первая цифра числа - чётная')

# num = 9234
# num1 = num // 1000
# num4 = num % 10
# if num1 > num4:
#     print(f'Первая цифра числа {num} больше последней')
# elif num1 < num4:
#     print(f'Первая цифра числа {num} vtymit последней')
# else:
#     print('Числа равны')

# num = 45
# if (num // 10 + num % 10) % 2 == 0:
#     print('Число чётное')
# else:
#     print('Число нечётное')

# num = 4567
# num4 = num % 10
# if num4 !=0 and num % num4 == 0:
#     print('Число делится без остатка')
# else:
#     print('Число не делится без остатка')

# num = 1234
# num12 = ((num // 1000)+ (num // 100 % 10))
# num34 = ((num // 10 % 10) + (num % 10))
# if num12 > num34:
#     print('Сумма первых двух цифр числа больше последних двух')
# else:
#     print('Сумма первых двух цифр числа меньше последних двух')

# yearsold = int(input('Введите ваш возраст: '))
# if yearsold >= 18 and  yearsold <= 100:
#     print('Вы подходите под диспансеризацию')
# elif 1 < yearsold < 18 or 100 < yearsold < 120:
#     print('Вы не подходите под диспансеризацию')
# else:
#     print('Вы введи неправильный тип данных')

# num = 315
# if 315 % 3 == 0 and 315 % 5 == 0 and 315 % 7 == 0:
#     print(f'Число {num} делится без остатка на 3, 5 и 7')

# soed = input('У вас плохое соединение? ')