#print('Как твоё имя?')
#print(input('Как твоё имя? '))

#print('Привет,', input('Имя первого игрока: '))
#print()
#print('Здравствуй,', input('Имя второго игрока: '))

# print('Привет,', input('Имя первого игрока: '), '\n')
# print('Здравствуй,', input('Имя второго игрока: '))

# print(1, 2, 3, -5)
# print(-1.9, 2.98, 3.8, -5.5)

# print('Сумма двух чисел =', 5 + 5)
# print('Сумма двух чисел =', '5 + 5 =', 5 + 5)
# print('Результат сложения', 5, '+', 5, 'равен', 5 + 5)

# print(10 - 5)
# print(2 * 2)
# print(5 ** 2)
# print(2 + 2 * 3)

# print(7 / 2) #Значение частного (обычное деление)
# print(7 // 2) #Целочисленное деление
# print(7 % 2) #Остаток от деления
# print(210 % 150) #Остаток от деления

# print(454848489 % 10)
# print(454848489 % 10)
#
# print(454848489//100)
# print(454848489//10000000)
#
# print(35462 % 10000 // 100 > 40)